# **11. 여러 기준으로 정렬하기(250120)(SELECT)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 모든 동물의 아이디와 이름, 보호 시작일을 이름 순으로 조회하는 SQL문을 작성해주세요.
# 단, 이름이 같은 동물 중에서는 보호를 나중에 시작한 동물을 먼저 보여줘야 합니다.

# 예시
# 예를 들어, ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A349996	Cat	2018-01-22 14:32:00	Normal	Sugar	Neutered Male
# A350276	Cat	2017-08-13 13:50:00	Normal	Jewel	Spayed Female
# A396810	Dog	2016-08-22 16:13:00	Injured	Raven	Spayed Female
# A410668	Cat	2015-11-19 13:41:00	Normal	Raven	Spayed Female
# 이름을 사전 순으로 정렬하면 다음과 같으며, 'Jewel', 'Raven', 'Sugar'
# 'Raven'이라는 이름을 가진 개와 고양이가 있으므로, 이 중에서는 보호를 나중에 시작한 개를 먼저 조회합니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME	DATETIME
# A350276	Jewel	2017-08-13 13:50:00
# A396810	Raven	2016-08-22 16:13:00
# A410668	Raven	2015-11-19 13:41:00
# A349996	Sugar	2018-01-22 14:32:00

1) 내가 쓴 코드

In [ ]:
# SELECT ANIMAL_ID, NAME, DATETIME
# FROM ANIMAL_INS
# ORDER BY NAME ASC, DATETIME DESC

# **12. 어린 동물 찾기(250121)**(SELECT)

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 동물 중 젊은 동물1의 아이디와 이름을 조회하는 SQL 문을 작성해주세요. 이때 결과는 아이디 순으로 조회해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A365172	Dog	2014-08-26 12:53:00	Normal	Diablo	Neutered Male
# A367012	Dog	2015-09-16 09:06:00	Sick	Miller	Neutered Male
# A365302	Dog	2017-01-08 16:34:00	Aged	Minnie	Spayed Female
# A381217	Dog	2017-07-08 09:41:00	Sick	Cherokee	Neutered Male
# 이 중 젊은 동물은 Diablo, Miller, Cherokee입니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME
# A365172	Diablo
# A367012	Miller
# A381217	Cherokee

In [ ]:
# SELECT ANIMAL_ID, NAME
# FROM ANIMAL_INS
# WHERE NOT INTAKE_CONDITION = 'Aged'
# ORDER BY ANIMAL_ID

# **13. 최솟값 구하기(250122)(SUM, MAX, MIN)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 가장 먼저 들어온 동물은 언제 들어왔는지 조회하는 SQL 문을 작성해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A399552	Dog	2013-10-14 15:38:00	Normal	Jack	Neutered Male
# A379998	Dog	2013-10-23 11:42:00	Normal	Disciple	Intact Male
# A370852	Dog	2013-11-03 15:04:00	Normal	Katie	Spayed Female
# A403564	Dog	2013-11-18 17:03:00	Normal	Anna	Spayed Female
# 가장 먼저 들어온 동물은 Jack이고, Jack은 2013-10-14 15:38:00에 들어왔습니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# 시간
# 2013-10-14 15:38:00
# ※ 컬럼 이름(위 예제에서는 "시간")은 일치하지 않아도 됩니다.

In [ ]:
# SELECT MIN(DATETIME)
# FROM ANIMAL_INS
# ORDER BY DATETIME

# **14. 이름이 없는 동물의 아이디(250123)(IS NULL)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 동물 중, 이름이 없는 채로 들어온 동물의 ID를 조회하는 SQL 문을 작성해주세요. 단, ID는 오름차순 정렬되어야 합니다.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A368930	Dog	2014-06-08 13:20:00	Normal	NULL	Spayed Female
# A524634	Dog	2015-01-02 18:54:00	Normal	*Belle	Intact Female
# A465637	Dog	2017-06-04 08:17:00	Injured	*Commander	Neutered Male
# 이름이 없는 채로 들어온 동물의 ID는 A368930입니다. 따라서 SQL을 실행하면 다음과 같이 출력되어야 합니다.

# ANIMAL_ID
# A368930

In [ ]:
# SELECT ANIMAL_ID
# FROM ANIMAL_INS
# WHERE NAME IS NULL
# ORDER BY ANIMAL_ID

# **15. 동명 동물 수 찾기(250127)(GROUP BY)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 동물 이름 중 두 번 이상 쓰인 이름과 해당 이름이 쓰인 횟수를 조회하는 SQL문을 작성해주세요.
# 이때 결과는 이름이 없는 동물은 집계에서 제외하며, 결과는 이름 순으로 조회해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A396810	Dog	2016-08-22 16:13:00	Injured	Raven	Spayed Female
# A377750	Dog	2017-10-25 17:17:00	Normal	Lucy	Spayed Female
# A355688	Dog	2014-01-26 13:48:00	Normal	Shadow	Neutered Male
# A399421	Dog	2015-08-25 14:08:00	Normal	Lucy	Spayed Female
# A400680	Dog	2017-06-17 13:29:00	Normal	Lucy	Spayed Female
# A410668	Cat	2015-11-19 13:41:00	Normal	Raven	Spayed Female
# Raven 이름은 2번 쓰였습니다.
# Lucy 이름은 3번 쓰였습니다
# Shadow 이름은 1번 쓰였습니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# NAME	COUNT
# Lucy	3
# Raven	2

1) 내 코드

In [ ]:
# SELECT NAME, COUNT(NAME) as COUNT
# FROM ANIMAL_INS
# WHERE NAME IS NOT NULL
# GROUP BY NAME
# HAVING COUNT(NAME) >= 2
# ORDER BY NAME

# **16. 이름에 el이 들어가는 동물 찾기(250131)(String, Date)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 보호소에 돌아가신 할머니가 기르던 개를 찾는 사람이 찾아왔습니다.
# 이 사람이 말하길 할머니가 기르던 개는 이름에 'el'이 들어간다고 합니다.
# 동물 보호소에 들어온 동물 이름 중, 이름에 "EL"이 들어가는 개의 아이디와 이름을 조회하는 SQL문을 작성해주세요.
# 이때 결과는 이름 순으로 조회해주세요. 단, 이름의 대소문자는 구분하지 않습니다.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A355753	Dog	2015-09-10 13:14:00	Normal	Elijah	Neutered Male
# A352872	Dog	2015-07-09 17:51:00	Aged	Peanutbutter	Neutered Male
# A353259	Dog	2016-05-08 12:57:00	Injured	Bj	Neutered Male
# A373219	Cat	2014-07-29 11:43:00	Normal	Ella	Spayed Female
# A382192	Dog	2015-03-13 13:14:00	Normal	Maxwell 2	Intact Male
# 이름에 'el'이 들어가는 동물은 Elijah, Ella, Maxwell 2입니다.
# 이 중, 개는 Elijah, Maxwell 2입니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME
# A355753	Elijah
# A382192	Maxwell 2

1) 내 코드

In [ ]:
# SELECT ANIMAL_ID, NAME
# FROM ANIMAL_INS
# WHERE NAME LIKE '%el%' AND ANIMAL_TYPE = 'Dog'
# ORDER BY NAME

# **17. NULL 처리하기(250201)(IS NULL)**(오답)

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 입양 게시판에 동물 정보를 게시하려 합니다. 동물의 생물 종, 이름, 성별 및 중성화 여부를 아이디 순으로 조회하는 SQL문을 작성해주세요.
# 이때 프로그래밍을 모르는 사람들은 NULL이라는 기호를 모르기 때문에, 이름이 없는 동물의 이름은 "No name"으로 표시해 주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A350276	Cat	2017-08-13 13:50:00	Normal	Jewel	Spayed Female
# A350375	Cat	2017-03-06 15:01:00	Normal	Meo	Neutered Male
# A368930	Dog	2014-06-08 13:20:00	Normal	NULL	Spayed Female
# 마지막 줄의 개는 이름이 없기 때문에, 이 개의 이름은 "No name"으로 표시합니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_TYPE	NAME	SEX_UPON_INTAKE
# Cat	Jewel	Spayed Female
# Cat	Meo	Neutered Male
# Dog	No name	Spayed Female
# ※ 컬럼 이름은 일치하지 않아도 됩니다.

1) 내 코드(오답)

2) gpt 코드

In [ ]:
# SELECT ANIMAL_TYPE,  -- 동물의 생물 종을 선택
#        IFNULL(NAME, 'No name') AS NAME,  -- NAME이 NULL이면 'No name'으로 표시, 아니면 기존 값 유지
#        SEX_UPON_INTAKE  -- 성별 및 중성화 여부 선택
# FROM ANIMAL_INS  -- ANIMAL_INS 테이블에서 조회
# ORDER BY ANIMAL_ID;  -- ANIMAL_ID 기준으로 오름차순 정렬

In [ ]:
# 설명
# 1. SELECT ANIMAL_TYPE
#  - ANIMAL_TYPE 컬럼을 선택하여 동물의 종(예: 개, 고양이 등)을 가져옵니다.

# 2. IFNULL(NAME, 'No name') AS NAME
#  - NAME 컬럼이 NULL이면 "No name"으로 변경하고, 그렇지 않으면 기존 NAME 값을 유지합니다.
#  - IFNULL(column, 대체값)은 MySQL에서 제공하는 함수로, column 값이 NULL이면 대체값을 반환합니다.
#  - 결과적으로, 보호소에 들어올 때 이름이 없는 동물은 "No name"으로 표시됩니다.

In [ ]:
# SELECT ANIMAL_TYPE,  -- 동물의 생물 종을 선택
#        CASE WHEN NAME IS NULL THEN 'No name' ELSE NAME END AS NAME,  -- NAME이 NULL이면 'No name', 그렇지 않으면 원래 값 유지
#        SEX_UPON_INTAKE  -- 성별 및 중성화 여부 선택
# FROM ANIMAL_INS  -- ANIMAL_INS 테이블에서 조회
# ORDER BY ANIMAL_ID;  -- ANIMAL_ID 기준으로 오름차순 정렬

In [ ]:
# 설명

# 1. SELECT ANIMAL_TYPE
#  - 동물의 생물 종(개, 고양이 등)을 조회합니다.

# 2. CASE WHEN NAME IS NULL THEN 'No name' ELSE NAME END AS NAME
#  - CASE 문을 사용하여 NAME 값이 NULL인지 확인합니다.
#  - WHEN NAME IS NULL THEN 'No name' → NAME 값이 NULL이면 "No name"으로 변경합니다.
#  - ELSE NAME → 그렇지 않으면 기존 NAME 값을 그대로 유지합니다.
#  - END → CASE 문을 종료합니다.
#  - 결과적으로 NULL 값을 "No name"으로 변환하여 출력합니다.

# **18. DATETIME에서 DATE로 형 변환(250205)(String, Date)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# ANIMAL_INS 테이블에 등록된 모든 레코드에 대해,

# 각 동물의 아이디와 이름, 들어온 날짜1를 조회하는 SQL문을 작성해주세요. 이때 결과는 아이디 순으로 조회해야 합니다.

# 예시
# 예를 들어, ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_INS

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A349996	Cat	2018-01-22 14:32:00	Normal	Sugar	Neutered Male
# A350276	Cat	2017-08-13 13:50:00	Normal	Jewel	Spayed Female
# A350375	Cat	2017-03-06 15:01:00	Normal	Meo	Neutered Male
# A352555	Dog	2014-08-08 04:20:00	Normal	Harley	Spayed Female
# A352713	Cat	2017-04-13 16:29:00	Normal	Gia	Spayed Female
# SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME	날짜
# A349996	Sugar	2018-01-22
# A350276	Jewel	2017-08-13
# A350375	Meo	2017-03-06
# A352555	Harley	2014-08-08
# A352713	Gia	2017-04-13

1) 내 코드

In [ ]:
SELECT ANIMAL_ID, NAME, DATE_FORMAT(DATETIME, '%Y-%m-%d') AS 날짜
FROM ANIMAL_INS
ORDER BY ANIMAL_ID;

# **19. 경기도에 위치한 식품창고 목록 출력하기(250206)(IS NULL)**

In [ ]:
# 문제 설명
# 다음은 식품창고의 정보를 담은 FOOD_WAREHOUSE 테이블입니다.
# FOOD_WAREHOUSE 테이블은 다음과 같으며 WAREHOUSE_ID, WAREHOUSE_NAME, ADDRESS, TLNO, FREEZER_YN는 창고 ID, 창고 이름, 창고 주소, 전화번호, 냉동시설 여부를 의미합니다.

# Column name	Type	Nullable
# WAREHOUSE_ID	VARCHAR(10)	FALSE
# WAREHOUSE_NAME	VARCHAR(20)	FALSE
# ADDRESS	VARCHAR(100)	TRUE
# TLNO	VARCHAR(20)	TRUE
# FREEZER_YN	VARCHAR(1)	TRUE
# 문제
# FOOD_WAREHOUSE 테이블에서 경기도에 위치한 창고의 ID, 이름, 주소, 냉동시설 여부를 조회하는 SQL문을 작성해주세요.
# 이때 냉동시설 여부가 NULL인 경우, 'N'으로 출력시켜 주시고 결과는 창고 ID를 기준으로 오름차순 정렬해주세요.

# 예시
# FOOD_WAREHOUSE 테이블이 다음과 같을 때

# WAREHOUSE_ID	WAREHOUSE_NAME	ADDRESS	TLNO	FREEZER_YN
# WH0001	창고_경기1	경기도 안산시 상록구 용담로 141	031-152-1332	Y
# WH0002	창고_충북1	충청북도 진천군 진천읍 씨제이로 110	043-623-9900	Y
# WH0003	창고_경기2	경기도 이천시 마장면 덕평로 811	031-221-7241	NULL
# WH0004	창고_경기3	경기도 김포시 대곶면 율생중앙로205번길	031-671-1900	N
# WH0005	창고_충남1	충청남도 천안시 동남구 광덕면 신덕리1길 9	041-876-5421	Y
# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# WAREHOUSE_ID	WAREHOUSE_NAME	ADDRESS	FREEZER_YN
# WH0001	창고_경기1	경기도 안산시 상록구 용담로 141	Y
# WH0003	창고_경기2	경기도 이천시 마장면 덕평로 811	N
# WH0004	창고_경기3	경기도 김포시 대곶면 율생중앙로205번길	N

In [ ]:
# SELECT WAREHOUSE_ID, WAREHOUSE_NAME, ADDRESS, IFNULL(FREEZER_YN, 'N') AS FREEZER_YN
# FROM FOOD_WAREHOUSE
# WHERE ADDRESS LIKE '경기도%'
# ORDER BY WAREHOUSE_ID;

# **20. 가격이 제일 비싼 식품의 정보 출력하기(250210)(SUM, MAX, MIN)**

In [ ]:
# 문제 설명
# 다음은 식품의 정보를 담은 FOOD_PRODUCT 테이블입니다. FOOD_PRODUCT 테이블은 다음과 같으며
# PRODUCT_ID, PRODUCT_NAME, PRODUCT_CD, CATEGORY, PRICE는 식품 ID, 식품 이름, 식품 코드, 식품분류, 식품 가격을 의미합니다.

# Column name	Type	Nullable
# PRODUCT_ID	VARCHAR(10)	FALSE
# PRODUCT_NAME	VARCHAR(50)	FALSE
# PRODUCT_CD	VARCHAR(10)	TRUE
# CATEGORY	VARCHAR(10)	TRUE
# PRICE	NUMBER	TRUE

# 문제
# FOOD_PRODUCT 테이블에서 가격이 제일 비싼 식품의 식품 ID, 식품 이름, 식품 코드, 식품분류, 식품 가격을 조회하는 SQL문을 작성해주세요.

# 예시
# FOOD_PRODUCT 테이블이 다음과 같을 때

# PRODUCT_ID	PRODUCT_NAME	PRODUCT_CD	CATEGORY	PRICE
# P0018	맛있는고추기름	CD_OL00008	식용유	6100
# P0019	맛있는카놀라유	CD_OL00009	식용유	5100
# P0020	맛있는산초유	CD_OL00010	식용유	6500
# P0021	맛있는케첩	CD_OL00001	소스	4500
# P0022	맛있는마요네즈	CD_OL00002	소스	4700
# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# PRODUCT_ID	PRODUCT_NAME	PRODUCT_CD	CATEGORY	PRICE
# P0020	맛있는산초유	CD_OL00010	식용유	6500

1) 내 코드

In [ ]:
# SELECT PRODUCT_ID, PRODUCT_NAME, PRODUCT_CD, CATEGORY, MAX(PRICE)
# FROM FOOD_PRODUCT;

MAX(PRICE)를 사용하면 테이블의 가장 큰 가격 값만 가져오지만,

PRODUCT_ID, PRODUCT_NAME, PRODUCT_CD, CATEGORY가 GROUP BY 없이 함께 조회되었기 때문에 에러 발생 또는 예상과 다른 결과 출력

2) gpt 코드

In [ ]:
# SELECT PRODUCT_ID, PRODUCT_NAME, PRODUCT_CD, CATEGORY, PRICE
# FROM FOOD_PRODUCT
# ORDER BY PRICE DESC
# LIMIT 1;

In [ ]:
# SELECT PRODUCT_ID, PRODUCT_NAME, PRODUCT_CD, CATEGORY, PRICE
# FROM FOOD_PRODUCT
# WHERE PRICE = (SELECT MAX(PRICE) FROM FOOD_PRODUCT);